backend1/app/controllers/item_pedidos_controller.rb

SELECT "item_pedidos".* FROM "item_pedidos"
---
    def index
        @item = ItemPedido.all

SELECT "item_pedidos".* FROM "item_pedidos" WHERE "item_pedidos"."id_pedido" = $1  [["id_pedido", 2]]
---
    def show
        @item= ItemPedido.where(id_pedido: params[:id])

INSERT INTO "item_pedidos" ("id_pedido", "id_producto", "cantidad", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id_pedido", 9], ["id_producto", 2], ["cantidad", 1], ["created_at", "2022-09-05 19:14:27.651447"], ["updated_at", "2022-09-05 19:14:27.651447"]]
---
    def create
        @item = ItemPedido.create(
            id_pedido: params[:id_pedido],
            id_producto: params[:id_producto],
            cantidad: params[:cantidad],

        )