backend1/app/controllers/items_controller.rb

    def show
        @items = SecretMenuItem.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]