backend1/app/controllers/lista_pedidos_controller.rb

    def index
        @pedidos = ListaPedido.all
---
SELECT "lista_pedidos".* FROM "lista_pedidos"

    def create
        @pedidos = ListaPedido.create(
            id_pedido: params[:id_pedido],
            nombre: params[:nombre],
            telefono: params[:telefono],
            direccion: params[:direccion],
            estado: params[:estado],

        )
---
INSERT INTO "lista_pedidos" ("id_pedido", "nombre", "telefono", "direccion", "estado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"