backend1/app/controllers/pedidos_controller.rb

SELECT "pedidos".* FROM "pedidos"
---
    def index
        @pedidos = Pedido.all

INSERT INTO "pedidos" ("nombre_ciente", "direccion", "estado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @pedidos = Pedido.create(
            nombre_ciente: params[:nombre_ciente],
            direccion: params[:direccion],
            estado: params[:estado],

        )