backend1/app/controllers/productos_controller.rb

SELECT "productos".* FROM "productos"
---
    def index
        @productos = Producto.all

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @productos = Producto.find(params[:id])

INSERT INTO "productos" ("nombre", "descripcion", "precio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", nil], ["descripcion", nil], ["precio", nil], ["created_at", "2022-09-01 18:00:43.460182"], ["updated_at", "2022-09-01 18:00:43.460182"]]
---
    def create
        @productos = Producto.create(
            nombre: params[:nombre],
            descripcion: params[:descripcion],
            precio: params[:precio]
        )