backend1/app/controllers/secret_menu_items_controller.rb

SELECT "secret_menu_items".* FROM "secret_menu_items"
---
    def index
        @secretMenuItems = SecretMenuItem.all

SELECT "secret_menu_items".* FROM "secret_menu_items" WHERE "secret_menu_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @secretMenuItem = SecretMenuItem.find(params[:id])