backend1/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "admin0@gmail"]]
---
    def show
        @username = params[:username]
        @password = params[:password]
        @users = User.find(username: params[:id])

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "rick@gmail.com"], ["LIMIT", 1]]
---
    def create

        @username = params[:username]
        @password = params[:password]
        @users = User.find_by(username: params[:username])